{
    "experiences" : [
        {
            "title" : "Lorditheme Startup",
            "date" : "Senior Frontend Developer (Nuxt.js) (February 2021)",
            "explanation" : "Designed and Implemented E-Commerce Platform Successfully designed and implemented a robust e-commerce platform for web products, specializing in the sale of web templates and scripts. This platform has enhanced the company's market presence and streamlined online sales processes."
        },
        {
            "title": "Karbasi",
            "date": "Frontend Developer (March 2023 - October 2023)",
            "explanation": "As a frontend developer at Karbasi, I spearheaded the development of a high-performance and visually captivating e-commerce platform specifically designed for home decor and furnishing enthusiasts. Through my expertise in integrating technologies such as Vue.js and Tailwind CSS, I ensured a seamless and responsive user experience across various devices. My responsibilities included crafting dynamic and reusable components, optimizing page load speeds, and integrating third-party APIs to enhance the platform’s functionality. Collaborating closely with backend developers and UX designers, I diligently aligned the platform’s design and features with the preferences of our esteemed customers. Furthermore, I maintained a steadfast commitment to regular updates and testing, ensuring the platform’s functionality and security remained consistent with the latest industry standards."
        },
        {
            "title" : "Dehestaan",
            "date" : "Full-stack web Developer (January 2024 - June 2024)",
            "explanation" : "As the lead web developer at Dehestaan, I was responsible for designing and developing a comprehensive e-commerce platform focused on local agricultural products. I utilized modern technologies such as HTML, CSS, and JavaScript, ensuring the site was optimized for both user experience and search engine visibility. I implemented a content management system that allowed for easy content updates by the team and worked closely with designers to create an engaging and user-friendly interface. Additionally, I conducted thorough testing and debugging to ensure the site’s performance and security were top-notch."
        },
        {
            "title" : "Lordinet Startup",
            "date" : "Founder - Full-stack Developer (December 2019 - November 2023)",
            "explanation" : "I have successfully designed and implemented an e-learning platform using Laravel and Vue.js technologies. The project aimed to provide an online education platform with a user-friendly interface and robust admin panel."
        },
        {
            "title" : "Gam Academy",
            "date" : "Teacher - web developer (2017 - 2021)",
            "explanation" : "5+ years of teaching experience • implemented HTML, CSS, and VueJs courses • proposed and implemented teaching methods • Successfully integrated HTML , CSS , VueJs into the institute's curriculum • had over 100 Students • positive responses on intuitive teaching methods and impactful courses website: gamacademy.ir"
        }
    ],
    "educations" : [
        {
            "title" : "Mohammad Baqer Sari University",
            "date" : "2015-2016",
            "explanation" : "Studying in associate degree, software engineering field and starting programming activities"
        },
        {
            "title" : "Tabari University",
            "date" : "2017-2019",
            "explanation" : "Studying in the bachelor's degree in software engineering and starting to work in the web field (designing WordPress templates)."
        },
        {
            "title" : "Tabari University",
            "date" : "2020-2024",
            "explanation" : "Studying for a master's degree in software engineering and continuing to work in the field of websites, designing and developing Lordint's website and online training in the field of web."
        }
    ]
}